#language:ru

Функциональность: Вход

  Структура сценария: Вход в личный кабинет (укороченный)
    Пусть совершен переход на страницу "Страница входа" по ссылке "loginUrl"
    Когда страница "Страница входа" загрузилась
    Когда в поле "Логин" введено значение "<login>"
    И в поле "Пароль" введено значение "<password>"
    И выполнено нажатие на кнопку "Продолжить"
    Тогда страница "Подтверждение входа" загрузилась
    Когда в поле "Код" введено значение "<code>"
    И выполнено нажатие на кнопку "Продолжить"
    Тогда страница "Дашбоард" загрузилась

    Примеры:
      | login | password  | code  |
      | vasya | qwerty123 | 12345 |

  Структура сценария: Пользователь вводит неверный логин и пароль
    Пусть совершен переход на страницу "Страница входа" по ссылке "loginUrl"
    Когда страница "Страница входа" загрузилась
    Когда в поле "Логин" введено значение "<login>"
    И в поле "Пароль" введено значение "<password>"
    И выполнено нажатие на кнопку "Продолжить"
    Тогда элемент "неверный логин или пароль" отображается на странице

    Примеры:
      | login | password  |
      | vasy  | qwerty123 |
      | vasya | qwerty12  |
  
  Сценарий: Пользователь вводит неверный код верификации
    Пусть совершен переход на страницу "Страница входа" по ссылке "loginUrl"
    Когда страница "Страница входа" загрузилась
    Когда в поле "Логин" введено значение "vasya"
        И в поле "Пароль" введено значение "qwerty123"
        И выполнено нажатие на кнопку "Продолжить"
    Тогда страница "Подтверждение входа" загрузилась
    Когда в поле "Код" введено значение "54321"
        И выполнено нажатие на кнопку "Продолжить"
    Тогда элемент "неверно указан код" отображается на странице



